/// 1) стягивать данные с localStorage
// 2) после функционала всегла оьновалять localStorage
// 3)

// ? Метод reduce() применяет функцию reducer к каждому элементу массива (слева-направо), возвращая одно результирующее значение.
// Параметры
//  callback
// Функция, выполняющаяся для каждого элемента массива, принимает четыре аргумента:

// accumulator
// Аккумулятор, аккумулирующий значение, которое возвращает функция callback после посещения очередного элемента, либо значение initialValue, если оно предоставлено (смотрите пояснения ниже).

// currentValue
// Текущий обрабатываемый элемент массива.

// indexНеобязательный
// Индекс текущего обрабатываемого элемента массива.

// arrayНеобязательный
// Массив, для которого была вызвана функция reduce.

// initialValueНеобязательный
// Необязательный параметр. Объект, используемый в качестве первого аргумента при первом вызове функции callback.

//  todo Метод reduce() выполняет функцию callback один раз для каждого элемента, присутствующего в массиве, за исключением пустот, принимая четыре аргумента: начальное значение (или значение от предыдущего вызова callback), значение текущего элемента, текущий индекс и массив, по которому происходит итерация.
